Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_atim.h
#define    FL_ATIM_INDEX_POSITION_DOWN_DOWN                       (0x0U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_DOWN_UP                         (0x1U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_UP_DOWN                         (0x2U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_UP_UP                           (0x3U << ATIM_ECR_IPOS_Pos)


#define    FL_ATIM_INDEX_FIRST_ONLY                               (0x1U << ATIM_ECR_FIDX_Pos)
#define    FL_ATIM_INDEX_ALL                                      (0x0U << ATIM_ECR_FIDX_Pos)


#define    FL_ATIM_INDEX_UP_DOWN                                  (0x0U << ATIM_ECR_IDIR_Pos)
#define    FL_ATIM_INDEX_UP                                       (0x1U << ATIM_ECR_IDIR_Pos)
#define    FL_ATIM_INDEX_DOWN                                     (0x2U << ATIM_ECR_IDIR_Pos)


#define    FL_ATIM_ETRSOURCE_GPIO                                 (0x0U << ATIM_AFR_ETRSEL_Pos)
#define    FL_ATIM_ETRSOURCE_COMP1                                (0x1U << ATIM_AFR_ETRSEL_Pos)
#define    FL_ATIM_ETRSOURCE_COMP2                                (0x2U << ATIM_AFR_ETRSEL_Pos)
#define    FL_ATIM_ETRSOURCE_COMP3                                (0x3U << ATIM_AFR_ETRSEL_Pos)


#define    FL_ATIM_OCREF_CLRSOURCE_COMP1                          (0x0U << ATIM_AFR_OCCLR_SEL_Pos)
#define    FL_ATIM_OCREF_CLRSOURCE_COMP2                          (0x1U << ATIM_AFR_OCCLR_SEL_Pos)
#define    FL_ATIM_OCREF_CLRSOURCE_COMP3                          (0x2U << ATIM_AFR_OCCLR_SEL_Pos)


#define    LL_TIM_GROUPCH5_NONE                                   0x00000000U           
#define    LL_TIM_GROUPCH5_OC1REFC                                TIM_CCR5_GC5C1        
#define    LL_TIM_GROUPCH5_OC2REFC                                TIM_CCR5_GC5C2        
#define    LL_TIM_GROUPCH5_OC3REFC                                TIM_CCR5_GC5C3       

#define    FL_ATIM_BKIN_SOURCE_GPIO1                              (0x1U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_GPIO2                              (0x2U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_COMP0                              (0x4U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_COMP1                              (0x8U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_COMP2                              (0x10U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_COMP3                              (0x20U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_HFDET                              (0x100U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_SVD                                (0x200U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_LOCKUP                             (0x400U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_RAMPARITY                          (0x800U << ATIM_AFR_BKIN1E_Pos)
#define    FL_ATIM_BKIN_SOURCE_LUT                                (0x1000U << ATIM_AFR_BKIN1E_Pos)
/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ATIM_FL_Exported_Functions ATIM Exported Functions
  * @{
  */

/**
  * @brief    UIF remap enable
  * @rmtoll   CR1    UIFREMAP    FL_ATIM_EnableUIFRemap
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_EnableUIFRemap(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_UIFREMAP_Msk);
}

/**
  * @brief    Get UIF remap  status
  * @rmtoll   CR1    UIFREMAP    FL_ATIM_IsEnabledUIFRemap
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabledUIFRemap(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_UIFREMAP_Msk) == ATIM_CR1_UIFREMAP_Msk);
}

/**
  * @brief    UIF remap  disable
  * @rmtoll   CR1    UIFREMAP    FL_ATIM_DisableUIFRemap
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_DisableUIFRemap(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_UIFREMAP_Msk);
}

/**
  * @brief    Set clock division
  * @rmtoll   CR1    CKD    FL_ATIM_SetClockDivision
  * @param    TIMx TIM instance
  * @param    div This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV1
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV2
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV4
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetClockDivision(ATIM_Type* TIMx, uint32_t div)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_CKD_Msk, div);
}

/**
  * @brief    Get clock division
  * @rmtoll   CR1    CKD    FL_ATIM_GetClockDivision
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV1
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV2
  *           @arg @ref FL_ATIM_CLK_DIVISION_DIV4
  */
__STATIC_INLINE uint32_t FL_ATIM_GetClockDivision(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CKD_Msk));
}

/**
  * @brief    ARRP reload enable
  * @rmtoll   CR1    ARPE    FL_ATIM_EnableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_EnableARRPreload(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    Get ARRP reload enable status
  * @rmtoll   CR1    ARPE    FL_ATIM_IsEnabledARRPreload
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabledARRPreload(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk) == ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    ARRP reload disable
  * @rmtoll   CR1    ARPE    FL_ATIM_DisableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_DisableARRPreload(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    Set counter aligned mode 
  * @rmtoll   CR1    CMS    FL_ATIM_SetCounterAlignedMode
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetCounterAlignedMode(ATIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_CMS_Msk, mode);
}

/**
  * @brief    Get counter aligned mode
  * @rmtoll   CR1    CMS    FL_ATIM_GetCounterAlignedMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  */
__STATIC_INLINE uint32_t FL_ATIM_GetCounterAlignedMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CMS_Msk));
}

/**
  * @brief    Set counter direction
  * @rmtoll   CR1    DIR    FL_ATIM_SetCounterDirection
  * @param    TIMx TIM instance
  * @param    dir This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_COUNTER_DIR_UP
  *           @arg @ref FL_ATIM_COUNTER_DIR_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetCounterDirection(ATIM_Type* TIMx, uint32_t dir)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_DIR_Msk, dir);
}

/**
  * @brief    Get counter direction
  * @rmtoll   CR1    DIR    FL_ATIM_GetCounterDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_COUNTER_DIR_UP
  *           @arg @ref FL_ATIM_COUNTER_DIR_DOWN
  */
__STATIC_INLINE uint32_t FL_ATIM_GetCounterDirection(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_DIR_Msk));
}

/**
  * @brief    Set one pulse mode
  * @rmtoll   CR1    OPM    FL_ATIM_SetOnePulseMode
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_ONE_PULSE_MODE_CONTINUOUS
  *           @arg @ref FL_ATIM_ONE_PULSE_MODE_SINGLE
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetOnePulseMode(ATIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_OPM_Msk, mode);
}

/**
  * @brief    Get one pulse mode
  * @rmtoll   CR1    OPM    FL_ATIM_GetOnePulseMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_ONE_PULSE_MODE_CONTINUOUS
  *           @arg @ref FL_ATIM_ONE_PULSE_MODE_SINGLE
  */
__STATIC_INLINE uint32_t FL_ATIM_GetOnePulseMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_OPM_Msk));
}

/**
  * @brief    Set update source
  * @rmtoll   CR1    URS    FL_ATIM_SetUpdateSource
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_UPDATE_SOURCE_REGULAR
  *           @arg @ref FL_ATIM_UPDATE_SOURCE_COUNTER
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetUpdateSource(ATIM_Type* TIMx, uint32_t source)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_URS_Msk, source);
}

/**
  * @brief    Get update source
  * @rmtoll   CR1    URS    FL_ATIM_GetUpdateSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_UPDATE_SOURCE_REGULAR
  *           @arg @ref FL_ATIM_UPDATE_SOURCE_COUNTER
  */
__STATIC_INLINE uint32_t FL_ATIM_GetUpdateSource(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_URS_Msk));
}

/**
  * @brief    Update event enable
  * @rmtoll   CR1    UDIS    FL_ATIM_EnableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_EnableUpdateEvent(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    Get update event enable status
  * @rmtoll   CR1    UDIS    FL_ATIM_IsEnabledUpdateEvent
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabledUpdateEvent(ATIM_Type* TIMx)
{
    return (uint32_t)!(READ_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk) == ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    Disable update event
  * @rmtoll   CR1    UDIS    FL_ATIM_DisableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_DisableUpdateEvent(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    counter enable
  * @rmtoll   CR1    CEN    FL_ATIM_Enable
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_Enable(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk);
}

/**
  * @brief    Get counter enable status
  * @rmtoll   CR1    CEN    FL_ATIM_IsEnabled
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabled(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk) == ATIM_CR1_CEN_Msk);
}

/**
  * @brief    counter disable
  * @rmtoll   CR1    CEN    FL_ATIM_Disable
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_Disable(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk);
}

/**
  * @brief    Set the synchronous trigger signal source
  * @rmtoll   CR2    MMS2    FL_ATIM_SetTriggerOutput2
  * @param    TIMx TIM instance
  * @param    triggerOutput This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TRGO_UG
  *           @arg @ref FL_ATIM_TRGO_ENABLE
  *           @arg @ref FL_ATIM_TRGO_UPDATE
  *           @arg @ref FL_ATIM_TRGO_CC1IF
  *           @arg @ref FL_ATIM_TRGO_OC1REF
  *           @arg @ref FL_ATIM_TRGO_OC2REF
  *           @arg @ref FL_ATIM_TRGO_OC3REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF
  *           @arg @ref FL_ATIM_TRGO_OC5REF
  *           @arg @ref FL_ATIM_TRGO_OC6REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISINGFALLING
  *           @arg @ref FL_ATIM_TRGO_OC6REF_RISINGFALLING
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISING_OC6REF_RISING
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISING_OC6REF_FALLING
  *           @arg @ref FL_ATIM_TRGO_OC5REF_RISING_OC6REF_RISING
  *           @arg @ref FL_ATIM_TRGO_OC5REF_RISING_OC6REF_FALLING
  * @param    TIMx TIM instance
  * @param    triggerOutput This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TRGO_UG
  *           @arg @ref FL_ATIM_TRGO_ENABLE
  *           @arg @ref FL_ATIM_TRGO_UPDATE
  *           @arg @ref FL_ATIM_TRGO_CC1IF
  *           @arg @ref FL_ATIM_TRGO_OC1REF
  *           @arg @ref FL_ATIM_TRGO_OC2REF
  *           @arg @ref FL_ATIM_TRGO_OC3REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF
  *           @arg @ref FL_ATIM_TRGO_OC5REF
  *           @arg @ref FL_ATIM_TRGO_OC6REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISINGFALLING
  *           @arg @ref FL_ATIM_TRGO_OC6REF_RISINGFALLING
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISING_OC6REF_RISING
  *           @arg @ref FL_ATIM_TRGO_OC4REF_RISING_OC6REF_FALLING
  *           @arg @ref FL_ATIM_TRGO_OC5REF_RISING_OC6REF_RISING
  *           @arg @ref FL_ATIM_TRGO_OC5REF_RISING_OC6REF_FALLING
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetTriggerOutput2(ATIM_Type* TIMx, uint32_t triggerOutput)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_MMS2_Msk, triggerOutput);
}

/**
  * @brief    Set the OCN output idle state
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OISN    FL_ATIM_OC_SetReverseChannelIdleState
  * @param    TIMx TIM instance
  * @param    OCNIdleState This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OCN_IDLE_STATE_LOW
  *           @arg @ref FL_ATIM_OCN_IDLE_STATE_HIGH
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CHANNEL_1
  *           @arg @ref FL_ATIM_CHANNEL_2
  *           @arg @ref FL_ATIM_CHANNEL_3
  *           @arg @ref FL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_OC_SetReverseChannelIdleState(ATIM_Type* TIMx, uint32_t OCNIdleState, uint32_t channel)
{
    MODIFY_REG(TIMx->CR2, (ATIM_CR2_OISN_Msk << (channel * 2)), OCNIdleState << (channel * 2));
}

/**
  * @brief    Get the OCN output idle state
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OISN    FL_ATIM_OC_GetReverseChannelIdleState
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CHANNEL_1
  *           @arg @ref FL_ATIM_CHANNEL_2
  *           @arg @ref FL_ATIM_CHANNEL_3
  *           @arg @ref FL_ATIM_CHANNEL_4
    * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OCN_IDLE_STATE_LOW
  *           @arg @ref FL_ATIM_OCN_IDLE_STATE_HIGH
  */
__STATIC_INLINE uint32_t FL_ATIM_OC_GetReverseChannelIdleState(ATIM_Type* TIMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, (ATIM_CR2_OISN_Msk << (channel * 2))));
}

/**
  * @brief    Set the OC output idle state
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OIS    FL_ATIM_OC_SetChannelIdleState
  * @param    TIMx TIM instance
  * @param    OCIdleState This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OC_IDLE_STATE_LOW
  *           @arg @ref FL_ATIM_OC_IDLE_STATE_HIGH
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CHANNEL_1
  *           @arg @ref FL_ATIM_CHANNEL_2
  *           @arg @ref FL_ATIM_CHANNEL_3
  *           @arg @ref FL_ATIM_CHANNEL_4
  *           @arg @ref FL_ATIM_CHANNEL_5
  *           @arg @ref FL_ATIM_CHANNEL_6

  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_OC_SetChannelIdleState(ATIM_Type* TIMx, uint32_t OCIdleState, uint32_t channel)
{
    MODIFY_REG(TIMx->CR2, (ATIM_CR2_OIS_Msk << (channel * 2)), OCIdleState << (channel * 2));
}

/**
  * @brief    Get the OC output idle state
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OIS    FL_ATIM_OC_GetChannelIdleState
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CHANNEL_1
  *           @arg @ref FL_ATIM_CHANNEL_2
  *           @arg @ref FL_ATIM_CHANNEL_3
  *           @arg @ref FL_ATIM_CHANNEL_4
  *           @arg @ref FL_ATIM_CHANNEL_5
  *           @arg @ref FL_ATIM_CHANNEL_6

  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OC_IDLE_STATE_LOW
  *           @arg @ref FL_ATIM_OC_IDLE_STATE_HIGH
  */
__STATIC_INLINE uint32_t FL_ATIM_OC_GetChannelIdleState(ATIM_Type* TIMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, (ATIM_CR2_OIS_Msk << (channel * 2))));
}

/**
  * @brief    Channel 1 input source selection
  * @rmtoll   CR2    TI1S    FL_ATIM_IC_EnableXORCombination
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_IC_EnableXORCombination(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR2, ATIM_CR2_TI1S_Msk);
}

/**
  * @brief    Read the channel 1 input source

  * @rmtoll   CR2    TI1S    FL_ATIM_IC_IsEnabledXORCombination
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IC_IsEnabledXORCombination(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_TI1S_Msk) == ATIM_CR2_TI1S_Msk);
}

/**
  * @brief    XOR combinations are disabled for channel 1 input sources
  * @rmtoll   CR2    TI1S    FL_ATIM_IC_DisableXORCombination
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_IC_DisableXORCombination(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR2, ATIM_CR2_TI1S_Msk);
}

/**
  * @brief    Set the synchronous trigger signal source
  * @rmtoll   CR2    MMS    FL_ATIM_SetTriggerOutput
  * @param    TIMx TIM instance
  * @param    triggerOutput This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TRGO_RESET
  *           @arg @ref FL_ATIM_TRGO_ENABLE
  *           @arg @ref FL_ATIM_TRGO_UPDATE
  *           @arg @ref FL_ATIM_TRGO_CC1IF
  *           @arg @ref FL_ATIM_TRGO_OC1REF
  *           @arg @ref FL_ATIM_TRGO_OC2REF
  *           @arg @ref FL_ATIM_TRGO_OC3REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetTriggerOutput(ATIM_Type *TIMx, uint32_t triggerOutput)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_MMS_Msk, triggerOutput);
}

/**
  * @brief    读取同步触发源
  * @rmtoll   CR2    MMS    FL_ATIM_GetTriggerOutput
  * @param    TIMx TIM instance
  * @param    triggerOutput This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TRGO_RESET
  *           @arg @ref FL_ATIM_TRGO_ENABLE
  *           @arg @ref FL_ATIM_TRGO_UPDATE
  *           @arg @ref FL_ATIM_TRGO_CC1IF
  *           @arg @ref FL_ATIM_TRGO_OC1REF
  *           @arg @ref FL_ATIM_TRGO_OC2REF
  *           @arg @ref FL_ATIM_TRGO_OC3REF
  *           @arg @ref FL_ATIM_TRGO_OC4REF
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_ATIM_GetTriggerOutput(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_MMS_Msk));
}

/**
  * @brief    Set the trigger of the capture/compare DMA request
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    CCDS    FL_ATIM_SetDMAReqTrigger
  * @param    TIMx TIM instance
  * @param    DMAReqTrigger This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CCDMAREQUEST_CC
  *           @arg @ref FL_ATIM_CCDMAREQUEST_UPDATE
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetDMAReqTrigger(ATIM_Type* TIMx, uint32_t DMAReqTrigger)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_CCDS_Msk, DMAReqTrigger);
}

/**
  * @brief    Get the trigger of the capture/compare DMA request
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    CCDS    FL_ATIM_GetDMAReqTrigger
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_CCDMAREQUEST_CC
  */
__STATIC_INLINE uint32_t FL_ATIM_GetDMAReqTrigger(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_CCDS_Msk));
}

/**
  * @brief    Set the updated source of the capture/compare control bits (CCxE, CCxNE and OCxM)
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    CCUS    FL_ATIM_SetUpdate
  * @param    TIMx TIM instance
  * @param    CCUpdateSource This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_CCUPDATESOURCE_COMG_ONLY
  *           @arg @ref FL_ATIM_CCUPDATESOURCE_COMG_AND_TRGI
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetUpdate(ATIM_Type* TIMx, uint32_t CCUpdateSource)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_CCUS_Msk, CCUpdateSource);
}

/**
  * @brief    Get the updated source of the capture/compare control bits (CCxE, CCxNE and OCxM)
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    CCUS    FL_ATIM_GetUpdate
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_CCUPDATESOURCE_COMG_ONLY
  *           @arg @ref FL_ATIM_CCUPDATESOURCE_COMG_AND_TRGI
  */
__STATIC_INLINE uint32_t FL_ATIM_GetUpdate(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_CCUS_Msk));
}

/**
  * @brief    CC preload control enable 
  * @rmtoll   CR2    CCPC    FL_ATIM_CC_EnablePreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_CC_EnablePreload(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR2, ATIM_CR2_CCPC_Msk);
}

/**
  * @brief    Get CC preload control enable status
  * @rmtoll   CR2    CCPC    FL_ATIM_CC_IsEnabledPreload
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_CC_IsEnabledPreload(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_CCPC_Msk) == ATIM_CR2_CCPC_Msk);
}

/**
  * @brief    CC preload control disable 
  * @rmtoll   CR2    CCPC    FL_ATIM_CC_DisablePreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_CC_DisablePreload(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR2, ATIM_CR2_CCPC_Msk);
}

/**
  * @brief    Set the preload source of SMS
  * @rmtoll   SMCR    SMSPS    FL_ATIM_SetSMSPreloadSource
  * @param    TIMx TIM instance
  * @param    PreloadSource This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_SMSPS_TIMUPDATE
  *           @arg @ref FL_ATIM_OCREF_INDEX
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetSMSPreloadSource(ATIM_Type* TIMx, uint32_t PreloadSource)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_SMSPS_Msk, PreloadSource);
}

/**
  * @brief    Get the preload source of SMS
  * @rmtoll   SMCR    SMSPS    FL_ATIM_GetSMSPreloadSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_SMSPS_TIMUPDATE
  *           @arg @ref FL_ATIM_OCREF_INDEX
  */
__STATIC_INLINE uint32_t FL_ATIM_GetSMSPreloadSource(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_SMSPS_Msk));
}

